Hi @apparentlymart,

Here is the cleaned up terraform plan. Note that the source_code_hash isn't known until after the apply. I think that is the key to why the lambda layer is always being created. It makes sense to me now that I look at it. Terraform won't know the source code hash on a dynamically created file until it is created so it must assume that it must create the new layer. I think Terraform is behaving as designed. What do you think? 

```bash
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.layers.data.archive_file.layer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "layer" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "module/layer.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "module/bundle.crt"
      + type                = "zip"
    }

  # module.layers.aws_lambda_layer_version.layer must be replaced
-/+ resource "aws_lambda_layer_version" "layer" {
      ~ arn                         = "arn:aws:lambda:us-east-1:xxxxxxxxxxxx:layer:self-signed-certs:4" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-07-20T03:01:41.648+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-1:xxxxxxxxxxxx:layer:self-signed-certs:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-1:xxxxxxxxxxxx:layer:self-signed-certs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "H/bsVW3g00x6LFVchhXRi6/bla9CG8t/C1fsInn+flQ=" -> (known after apply) # forces replacement
      ~ source_code_size            = 96040 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.layers.local_sensitive_file.certs will be created
  + resource "local_sensitive_file" "certs" {
      + content              = (sensitive value)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "module/bundle.crt"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```